modules_cxf_src_test_java_org_mule_runtime_module_cxf_ProxyTestCase.java/[CN]/ProxyTestCase/[MT]/doTestProxyValidation(String)/body

{
  MuleClient client=muleContext.getClient();
  InternalMessage result=client.send(url,InternalMessage.builder().payload(msg).build(),HTTP_REQUEST_OPTIONS).getRight();
  String resString=getPayloadAsString(result);
  assertTrue(resString.indexOf("Schema validation error on message") != -1);
  String valid="<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">" + "<soap:Body> " + "<echo xmlns=\"http://www.muleumo.org\">"+ "  <echo>test</echo>"+ "</echo>"+ "</soap:Body>"+ "</soap:Envelope>";
  result=client.send(url,InternalMessage.builder().payload(valid).build(),HTTP_REQUEST_OPTIONS).getRight();
  resString=getPayloadAsString(result);
  assertTrue(resString.contains("<echoResponse xmlns=\"http://www.muleumo.org\">"));
}
